src/Documents/инкКадровыйПеревод/инкКадровыйПеревод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>инкКадровыйПеревод</name>
  <registerRecords>InformationRegister.инкПлановыеНачисления</registerRecords>
  <registerRecords>InformationRegister.инкКадроваяИсторияСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.инкДолжности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СевернаяНадбавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПеревода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПеревода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/инкКадроваяИсторияСотрудников/инкКадроваяИсторияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкКадроваяИсторияСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.инкДолжности</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.инкВидыКадровыхСобытий</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/инкПлановыеНачисления/инкПлановыеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкПлановыеНачисления</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РазмерНачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начисление</name>
    <type>
      <types>ChartOfCalculationTypesRef.инкНачисления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/инкВидыКадровыхСобытий/инкВидыКадровыхСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкВидыКадровыхСобытий</name>
  <enumValues>
    <name>Прием</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
  <enumValues>
    <name>НачальныеДанные</name>
  </enumValues>
  <enumValues>
    <name>ВосстановлениеВДолжности</name>
  </enumValues>
  <enumValues>
    <name>НеподтвержденныеДанные</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеОплатыТруда</name>
  </enumValues>
</mdclass:Enum>

src/ChartsOfCalculationTypes/инкНачисления/инкНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>инкНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.инкНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>ВыходноеПособие</name>
      <description>Выходное пособие</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>Командировка</description>
    </items>
    <items>
      <name>КомпенсацияЗаНеиспользованныйОтпуск</name>
      <description>Компенсация за неиспользованный отпуск</description>
    </items>
    <items>
      <name>МатПом217п28НК</name>
      <description>Матер. помощь ст. 217 п. 28 НК</description>
    </items>
    <items>
      <name>ОплатаДопВыходныхДляУходаЗаДетьмиИнвалидами</name>
      <description>Оплата доп. вых. для ухода за детьми инв</description>
    </items>
    <items>
      <name>ОплатаОчередныхОтпусков</name>
      <description>Оплата очередных отпусков</description>
    </items>
    <items>
      <name>Оклад</name>
      <description>Оплата по основному окладу</description>
    </items>
    <items>
      <name>ОплатаПоСреднемуЗаработку</name>
      <description>Оплата по среднему заработку</description>
    </items>
    <items>
      <name>ОсновнаяЗарплата</name>
      <description>Основная зарплата</description>
    </items>
    <items>
      <name>Подарки</name>
      <description>Подарки</description>
    </items>
    <items>
      <name>ПособиеПоВремНетрудоспособностиЗаСчетРаботодателя</name>
      <description>Пособ. по врем. нетруд. за счет работ.</description>
    </items>
    <items>
      <name>ПособиеВСвязиСНСиПЗ</name>
      <description>Пособие в связи с НС и ПЗ</description>
    </items>
    <items>
      <name>ПособиеНаПогребение</name>
      <description>Пособие на погребение</description>
    </items>
    <items>
      <name>ПособиеНаРаннейСтадииБеременности</name>
      <description>Пособие на ранней стадии беременности</description>
    </items>
    <items>
      <name>ПособиеНаРождРебенка</name>
      <description>Пособие на рожд. ребенка</description>
    </items>
    <items>
      <name>ПособиеПоБеременностиИРодам</name>
      <description>Пособие по беременности и родам</description>
    </items>
    <items>
      <name>ПособиеПоВремНетрудоспособности</name>
      <description>Пособие по врем нетрудоспособности</description>
    </items>
    <items>
      <name>ПособиеПоУходуЗаРебенкомДо1_5лет</name>
      <description>Пособие по уходу за ребенком до 1,5 лет</description>
    </items>
    <items>
      <name>РайонныйКоэффициент</name>
      <description>Районный коэффициент</description>
    </items>
    <items>
      <name>ОсновнойРайонныйКоэффициент</name>
      <description>Районный коэффициент</description>
    </items>
    <items>
      <name>Сальдо</name>
      <description>Сальдо</description>
    </items>
    <items>
      <name>СдельнаяОплатаТруда</name>
      <description>Сдельная опата труда</description>
    </items>
    <items>
      <name>СевернаяНадбавка</name>
      <description>Северная надбавка</description>
    </items>
    <items>
      <name>ОсновнаяСевернаяНадбавка</name>
      <description>Северная надбавка</description>
    </items>
  </predefined>
  <attributes>
    <name>ФондТравматизма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ст9ФЗ212</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ст238НК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СевернаяНадбавка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Премия</name>
    <type>
      <types>EnumRef.инкВидыПремий</types>
    </type>
  </attributes>
  <attributes>
    <name>Отпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Налог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МатериальнаяПомощь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВСтаройПрограмме</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоходНДФЛ</name>
    <type>
      <types>CatalogRef.инкДоходНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>Дебет</name>
    <type>
      <types>ChartOfAccountsRef.инкХозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВычетНДФЛ</name>
    <type>
      <types>CatalogRef.инкВычетыНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВПроцентах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Взносы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БольничныйЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

src/Documents/инкКадровыйПеревод/ObjectModule.bsl
#Область о //Служебные процедуры и функции:

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОбновлениеИнформацииОСотруднике();
	ЗаписьДвижений_инкКадроваяИсторияСотрудников();
	ЗаписьДвижений_инкПлановыеНачисления();
	
КонецПроцедуры

#КонецОбласти	

#Область о //Дополнительные процедуры и функции:

Процедура ОбновлениеИнформацииОСотруднике()
	
	обСотрудник = ЭтотОбъект.Сотрудник.ПолучитьОбъект();
	ЗаполнитьЗначенияСвойств(обСотрудник,ЭтотОбъект);
	обСотрудник.Записать();
	
КонецПроцедуры
 
#КонецОбласти	

#Область о //Запись движений:

Процедура ЗаписьДвижений_инкКадроваяИсторияСотрудников()
	
	Движения.инкКадроваяИсторияСотрудников.Записывать = Истина;
	
	Движение = Движения.инкКадроваяИсторияСотрудников.Добавить();
	ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
	Движение.Период = НачалоДня(ДатаПриказа);
    Движение.ВидСобытия = Перечисления.инкВидыКадровыхСобытий.Перемещение;
	
КонецПроцедуры

Процедура ЗаписьДвижений_инкПлановыеНачисления()
	
	Движения.инкПлановыеНачисления.Записывать = Истина;
	Если ЗначениеЗаполнено(ЭтотОбъект.Оклад) Тогда
		ДобавитьНачисление(ПланыВидовРасчета.инкНачисления.Оклад, ЭтотОбъект.Оклад);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтотОбъект.СевернаяНадбавка) Тогда
		ДобавитьНачисление(ПланыВидовРасчета.инкНачисления.СевернаяНадбавка, ЭтотОбъект.СевернаяНадбавка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьНачисление(Начисление, Размер) 
	
	Движение = Движения.инкПлановыеНачисления.Добавить();
	Движение.Период 			= НачалоДня(ЭтотОбъект.ДатаПриказа);
	Движение.Сотрудник 			= ЭтотОбъект.Сотрудник;
	Движение.Начисление      	= Начисление;
	Движение.Организация     	= ЭтотОбъект.Организация;
	Движение.Подразделение   	= ЭтотОбъект.Подразделение;     
	Движение.РазмерНачисления	= Размер;

КонецПроцедуры

#КонецОбласти
